controllers/UserController.php

    public function actionLogin() {
        $this->layout = 'login';
        $token = Yii::$app->request->get('token', '');

        if (!\Yii::$app->user->isGuest) {
            return $this->redirect(['manager/index']);
        }

        $user = \app\models\User::find()->where('token=:token', [':token' => $token])->one();
---
SELECT * FROM `tbl_user` WHERE token=''